{
  "tropes": [
    {
      "name": "Fake Dating",
      "books": [
        {
          "title": "The Love Con", 
          "author": "Seressia Glass", 
          "length": "309 pages", 
          "description": "He's cosplaying as her boyfriend but their feelings for each other are real in this romantic comedy from Seressia Glass.\n\nSometimes Kenya Davenport believes she was switched at the hospital--how else could a lover of anime, gaming, and cosplay come from STEM parents? Still, Kenya dreams of being able to turn her creative hobby into a career. She finally has a chance to make it big when she joins the reality show competition *Cosplay or No Way*.\n\nThere's just one catch: the challenge for the final round is all about iconic pairs, and the judges want the contestants' significant others to participate. Unfortunately, Kenya is as single as can be at the moment. Luckily her best friend, Cameron Lassiter, agrees to be her fake boyfriend for the show.\n\nRoleplaying a couple in love will force them to explore what they're hiding under the mask of friendship. Can Kenya and Cam fake it until she makes it, or will she be real about her feelings, knowing it could cost her the best friend she's ever had?", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/TheLoveCon.jpg", 
          "website": "https://seressia.com/books/the-love-con/"
        },
        {
          "title": "Fake It Till You Bake It", 
          "author": "Jamie Wesley", 
          "length": "336 pages", 
          "description": "A reality star and a cupcake-baking football player pretend to be a couple in order to save his bakery in this sweet and sexy romance from Jamie Wesley, Fake It Till You Bake It.\n\nJada Townsend-Matthews is the most reviled woman in America after turning down a proposal on a reality dating show. When she comes home to lick her wounds, Jada finds herself working at San Diego's newest cupcake bakery, Sugar Blitz, alongside the uptight owner and professional football player Donovan Dell.\n\nWhen a reporter mistakenly believes Jada and Donovan are an item, they realize they can use the misunderstanding to their advantage to help the struggling bakery and rehabilitate Jada's image. Faking a relationship should be simple, but sometimes love is the most unexpected ingredient.\n\nFake it Till You Bake It is a sweet confection of a novel, the perfect story to curl up with and enjoy with a cupcake on the side.", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/FakeTillYouBake.jpg", 
          "website": "https://www.jamiewesley.com/fake-it-till-you-bake-it"
        },
        {
          "title": "Honey & Spice", 
          "author": "Bolu Babalola", 
          "length": "368 pages", 
          "description": "*Sweet like plantain, hot like pepper. They taste   the best when together...*\n\nSharp-tongued (and secretly soft-hearted) Kiki Banjo has just made a huge mistake. As an expert in relationship-evasion and the host of the popular student radio show Brown Sugar, she's made it her mission to make sure the women of the African-Caribbean Society at Whitewell University do not fall into the mess of \"situationships\", players, and heartbreak. But when the Queen of the Unbothered kisses Malakai Korede, the guy she just publicly denounced as \"The Wastemen of Whitewell,\" in front of every Blackwellian on campus, she finds her show on the brink.\n\nThey're soon embroiled in a fake relationship to try and salvage their reputations and save their futures. Kiki has never surrendered her heart before, and a player like Malakai won't be the one to change that, no matter how charming he is or how electric their connection feels. But surprisingly entertaining study sessions and intimate, late-night talks at old-fashioned diners force Kiki to look beyond her own presumptions. Is she ready to open herself up to something deeper?\n\nA gloriously funny and sparkling debut novel, Honey and Spice is full of delicious tension and romantic intrigue that will make you weak at the knees.", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/Honey&Spice.jpg", 
          "website": "https://www.goodreads.com/book/show/59088365-honey-spice"
        },
      ]
    },
    {
      "name": "Found Family",
      "books": [
        {
          "title": "Blood at the Root", 
          "author": "LaDarrion Williams", 
          "length": "432 pages", 
          "description": "A teenager on the run from his past finds the family he never knew existed and the community he never knew he needed at an HBCU for the young, Black, and magical . Enroll in this fresh fantasy debut with the emotional power of Legendborn and the redefined ancestral magic of Lovecraft Country .\n\nTen years ago, Malik's life changed forever the night his mother mysteriously vanished and he discovered he had uncontrollable powers. Since then, he has kept his abilities hidden, looking out for himself and his younger foster brother, Taye. Now, at 17, Malik is finally ready to start a new life for both of them, far from the trauma of his past. However, a daring act to rescue Taye reveals an unexpected connection with his long-lost a legendary conjurer with ties to a hidden magical university that Malik’s mother attended.\n\nAt Caiman University, Malik’s eyes are opened to a future he never could have envisioned for himself— one that includes the reappearance of his first love, Alexis. His search for answers about his heritage, his powers, and what really happened to his mother exposes the cracks in their magical community as it faces a reawakened evil dating back to the Haitian Revolution. Together with Alexis, Malik discovers a lot beneath the surface at feuding covens and magical politics, forbidden knowledge and buried mysteries.\n\nIn a wholly unique saga of family, history and community, Malik must embrace his legacy to save what's left of his old family as well as his new one. Exploring the roots and secrets that connect us in an unforgettable contemporary setting, this heart-pounding fantasy series opener is a rich tapestry of atmosphere, intrigue, and emotion.", 
          "image": "https://raw.githubusercontent.com/BluPhyre/BookAppData/master/BloodRoot.jpg", 
          "website": "https://www.penguinrandomhouse.com/books/738959/blood-at-the-root-by-ladarrion-williams/"
        },
        {
          "title": "The Blood Trials", 
          "author": "N.E. Davenport", 
          "length": "480 pages", 
          "description": "Blending fantasy and science fiction, N. E. Davenport's fast-paced, action-packed debut kicks off a duology of loyalty and rebellion, in which a young Black woman must survive deadly trials in a racist and misogynistic society to become an elite warrior.\n\nIt's all about blood.\n\nThe blood spilled between the Republic of Mareen and the armies of the Blood Emperor long ago. The blood gifts of Mareen's deadliest enemies. The blood that runs through the elite War Houses of Mareen, the rulers of the Tribunal dedicated to keeping the republic alive.\n\nThe blood of the former Legatus, Verne Amari, murdered.\n\nFor his granddaughter, Ikenna, the only thing steady in her life was the man who had saved Mareen. The man who had trained her in secret, not just in martial skills, but in harnessing the blood gift that coursed through her.\n\nWho trained her to keep that a secret.\n\nBut now there are too many secrets, and with her grandfather assassinated, Ikenna knows two things: that only someone on the Tribunal could have ordered his death, and that only a Praetorian Guard could have carried out that order.\n\nBent on revenge as much as discovering the truth, Ikenna pledges herself to the Praetorian Trials--a brutal initiation that only a quarter of the aspirants survive. She subjects herself to the racism directed against her half-Khanaian heritage and the misogyny of a society that cherishes progeny over prodigy, all while hiding a power that--if found out--would subject her to execution...or worse. Ikenna is willing to risk it all because she needs to find out who murdered her grandfather...and then she needs to kill them.\n\nMareen has been at peace for a long time...\n\nIkenna joining the Praetorians is about to change all that.\n\nMagic and technology converge in the first part of this stunning debut duology, where loyalty to oneself--and one's blood--is more important than anything.", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/BloodTrials.jpg", 
          "website": "https://www.nedavenport.com/the-blood-trials"
        },
        {
          "title": "Raybearer", 
          "author": "Jordan Ifueko", 
          "length": "367 pages", 
          "description": "Tarisai has always longed for the warmth of a family. She was raised in isolation by a mysterious, often absent mother known only as The Lady. The Lady sends her to the capital of the global empire of Aritsar to compete with other children to be chosen as one of the Crown Prince’s Council of 11. If she’s picked, she’ll be joined with the other Council members through the Ray, a bond deeper than blood. That closeness is irresistible to Tarisai, who has always wanted to belong somewhere. But The Lady has other ideas, including a magical wish that Tarisai is compelled to obey: Kill the Crown Prince once she gains his trust. Tarisai won’t stand by and become someone’s pawn—but is she strong enough to choose a different path for herself?", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/Raybearer.jpg", 
          "website": "https://www.jordanifueko.com/raybearer-series"
        },
      ]
    },
    {
      "name": "Enemies to Lovers",
      "books": 
      [
        {
          "title": "The Book of Azrael", 
          "author": "Amber V. Nicole", 
          "length": "487 pages", 
          "description": "_World Ender meets Ender of Worlds..._\n\nA thousand years ago, Dianna gave up her life in the deserts of Eoria to save her dying sister. She called upon anyone who would listen, not expecting a monster far worse than any nightmare to answer. Now she does what Kaden asks, even if that means securing an ancient relic from the very creatures that hunt her.\n\n_A King thought long dead and long forgotten._\n\nIn the old world his name was Samkiel. In the new world it is Liam, but one title remains true throughout time. He is the World Ender, a myth to his enemies, a savior and King to those loyal to him. After the Gods War, he locked himself away, hiding from the world. He denied his crown and responsibilities, leaving the very ones who needed him most to deal with the fallout of the death of their homeworld. Now an attack on those he holds dear sends him back to the one realm he never wished to visit again and into the sights of an enemy he thought imprisoned eons ago.\n\nNow enemies older than time must put aside their differences and work together in hopes of saving both their world and every realm in between.", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/BookOfAzrael.jpg", 
          "website": "https://roseandstar.com/the-book-of-azrael"
        },
        {
          "title": "Vicious Bonds", 
          "author": "Shanora Williams", 
          "length": "466 pages", 
          "description": "_WILLOW_\n\nI was never meant to live an ordinary life, and when I’m dropped from the sky into a haunting forest, facing the barrel of an unknown man’s gun, I believe it to be true.\n\nRuler of Blackwater, Caz Harlow, is the man behind the gun. He’s broody, calculating, commanding and, surprisingly, I can hear every thought that runs through his mind. Because I can, he wants me out of his world and sent back to where I came from, so he makes it his mission to find a way.\n\nIt seems like a simple task, until I realize his world is unlike mine—that his is filled with violence, chaos, destruction, and gifted people who can kill you with one look. In his universe, it’s hard for a regular human like me to survive, but with Caz at my side, the possibility is higher. And the more time we spend together, the harder it is for me to ignore the connection that makes me feel alive.\n\nHe says we’re not meant to be, so why does everything about him set my soul on fire?\n\n_CAZ_\n\nI have too many enemies to count, and when this Willow woman drops into my forest, that’s exactly what I think she is: an enemy.\n\nBut then she makes a remark without even opening her mouth, and I realize I can hear her thoughts, and she can hear mine.\n\nAs Monarch of Blackwater, I can’t allow her to stay. By doing so, I risk losing everything I’ve worked so hard to build, so I make it my mission to find her a way back home.\n\nBut as this mission rolls on, I realize my bond with Willow goes much deeper than I ever could have imagined. And the more I reject her, the more pain I feel entering my body. However, when I lower my guard, the pain disappears and I crave her touch.\n\nThis relentless, undeniable bond is becoming impossible to ignore, but I can’t give into it. For if she stays, death will come for us, and it’s up to me to choose our fate.\n\nDo I risk staying with her and putting her life at constant risk, or do I sacrifice the one thing that brings me happiness and let her go?\n\n", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/ViciousBonds.jpg", 
          "website": "https://www.shanorawilliams.com/vicious-bonds"
        },
        {
          "title": "This Could Be Us", 
          "author": "Kennedy Ryan", 
          "length": "416 pages", 
          "description": "Soledad Barnes has her life all planned out. Because, of course, she does. She plans everything. She designs everything. She fixes everything. She’s a domestic goddess who's never met a party she couldn't host or a charge she couldn't lead. The one with all the answers and the perfect vinaigrette for that summer salad. But none of her varied talents can save her when catastrophe strikes, and the life she built with the man who was supposed to be her forever, goes poof in a cloud of betrayal and disillusion.\n\nBut there is no time to pout or sulk, or even grieve the life she lost. She's too busy keeping a roof over her daughters' heads and food on the table. And in the process of saving them all, Soledad rediscovers herself. From the ashes of a life burned to the ground, something bold and new can rise.\n\nBut then an unlikely man enters the picture—the forbidden one, the one she shouldn't want but can't seem to resist. She's lost it all before and refuses to repeat her mistakes. Can she trust him? Can she trust herself?\n\nAfter all she's lost . . .and found . . .can she be brave enough to make room for what could be?", 
          "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/CouldBeUs.jpg", 
          "website": "https://kennedyryanwrites.com/this-could-be-us/"
        },
      ]
    },
    {
      "name": "Magical/Mythical",
      "books": 
      [
        {
          "title": "House of Marionne", 
          "author": "J. Elle", 
          "length": "400 pages", 
          "description": "Rich is the blood of the chosen\n\n17 year-old Quell has lived her entire life on the run. She and her mother have fled from city to city, in order to hide the deadly magic that flows through Quell’s veins.\n\nUntil someone discovers her dark secret.\n\nTo hide from the assassin hunting her, and keep her mother out of harm’s way, Quell reluctantly inducts into a debutante society of magical social elites called the Order that she never knew existed. If she can pass their three rites of membership, mastering their proper form of magic, she’ll be able to secretly bury her forbidden magic forever.\n\nIf caught, she will be killed.\n\nBut becoming the perfect debutante is a lot harder than Quell imagined, especially when there’s more than tutoring happening with Jordan, her brooding mentor and— assassin in training.\n\nWhen Quell uncovers the deadly lengths the Order will go to defend its wealth and power, she’s forced to choose: embrace the dark magic she’s been running from her entire life or risk losing everything, and everyone, she’s grown to love.\n\nStill, she fears the most formidable monster she’ll have to face is the one inside.", 
"image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/61745561.jpg", 
          "website": "https://www.authorjelle.com/copy-of-a-taste-of-magic"
        },
        {
          "title": "Skin of the Sea", 
          "author": "Natasha Bowen", 
          "length": "336 pages", 
          "description": "A way to survive.\n\nA way to serve.\n\nA way to save.\n\nSimi prayed to the gods, once. Now she serves them as Mami Wata--a mermaid--collecting the souls of those who die at sea and blessing their journeys back home.\n\nBut when a living boy is thrown overboard, Simi does the unthinkable--she saves his life, going against an ancient decree. And punishment awaits those who dare to defy it.\n\nTo protect the other Mami Wata, Simi must journey to the Supreme Creator to make amends. But all is not as it seems. There's the boy she rescued, who knows more than he should. And something is shadowing Simi, something that would rather see her fail....\n\nDanger lurks at every turn, and as Simi draws closer, she must brave vengeful gods, treacherous lands, and legendary creatures. Because if she doesn't, then she risks not only the fate of all Mami Wata, but also the world as she knows it.\n\n",        "image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/SkinOfSea.jpg", 
          "website": "https://natashabowen.com/home/about-the-book/"
        },
        {
          "title": "Children of Blood and Bone", 
          "author": "Tomi Adeyemi", 
          "length": "544 pages", 
          "description": "They killed my mother.\nThey took our magic.\nThey tried to bury us.\n\nNow we rise.\n\nZélie Adebola remembers when the soil of Orïsha hummed with magic. Burners ignited flames, Tiders beckoned waves, and Zélie’s Reaper mother summoned forth souls.\n\nBut everything changed the night magic disappeared. Under the orders of a ruthless king, maji were killed, leaving Zélie without a mother and her people without hope.\n\nNow Zélie has one chance to bring back magic and strike against the monarchy. With the help of a rogue princess, Zélie must outwit and outrun the crown prince, who is hell-bent on eradicating magic for good.\n\nDanger lurks in Orïsha, where snow leoponaires prowl and vengeful spirits wait in the waters. Yet the greatest danger may be Zélie herself as she struggles to control her powers and her growing feelings for an enemy.", 
"image":"https://raw.githubusercontent.com/BluPhyre/BookAppData/master/CBB.jpg", 
          "website": "https://tomiadeyemi.com/the-writer/"
        }
      ]
    } 
  ]
}
